### ðŸ”¹ Q10. Explode the below column of lists into separate rows and reset the index.

In [2]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Hobbies': [['Reading', 'Swimming'], ['Gaming'], ['Music', 'Travel', 'Blogging']]
})

In [3]:
df.explode('Hobbies').reset_index(drop=True)

      Name   Hobbies
0    Alice   Reading
1    Alice  Swimming
2      Bob    Gaming
3  Charlie     Music
4  Charlie    Travel
5  Charlie  Blogging